//document.write(" <a id=\"StranLink\" >繁體中文</a>");
//模仿语言包式的简繁转换功能插件！
var Default_isFT = 0  //默认是否繁体，0-简体，1-繁体
var StranIt_Delay = 50 //翻译延时毫秒（设这个的目的是让网页先流畅的显现出来）
//－－－－－－－代码开始，以下别改－－－－－－－
//转换文本
function StranText(txt,toFT,chgTxt)
{
	if(txt==""||txt==null) return "";
	toFT=toFT==null?BodyIsFt:toFT;
	if(chgTxt) txt=txt.replace((toFT?"简":"繁"),(toFT?"繁":"简"));
	if(toFT) {return Traditionalized(txt);}
	else {return Simplized(txt);}
}

//转换对象，使用递归，逐层剥到文本
function StranBody(fobj)
{
	if(typeof(fobj)=="object"){
		var obj=fobj.childNodes;
	} else {
		var tmptxt=StranLink_Obj.innerHTML.toString();
		const metas = document.getElementsByTagName('meta');		
		if(tmptxt.indexOf("简")<0) {
			BodyIsFt=1;
			StranLink_Obj.innerHTML=StranText(tmptxt,0,1);
			StranLink.title=StranText(StranLink.title,0,1);
			//转换meta tag里的文本
			for (let i = 0; i < metas.length; i++) {
				metas[i].content = StranText(metas[i].getAttribute('content'), 1, 1);
			}
			document.title = StranText(document.title, 1, 1);
			document.getElementById("logo").src = "https://timednews.com/timednews_tc.png"; 
		} else {
			BodyIsFt=0
			StranLink_Obj.innerHTML=StranText(tmptxt,1,1);
			StranLink.title=StranText(StranLink.title,1,1);
			
			//转换meta tag里的文本
			for (let i = 0; i < metas.length; i++) {
				metas[i].content = StranText(metas[i].getAttribute('content'), 0, 1);
			}
			document.title = StranText(document.title, 0, 1);
			document.getElementById("logo").src = "https://timednews.com/timednews_cn.png"; 
		}
		setCookie(JF_cn,BodyIsFt,7)
		var obj=document.body.childNodes
 	}
	for(var i=0;i<obj.length;i++) {
		var OO=obj.item(i);
		if("||BR|HR|TEXTAREA|".indexOf("|"+OO.tagName+"|")>0||OO==StranLink_Obj) continue;
		if(OO.title!=""&&OO.title!=null) OO.title=StranText(OO.title);
		if(OO.alt!=""&&OO.alt!=null) OO.alt=StranText(OO.alt);
		if(OO.tagName=="INPUT"&&OO.value!=""&&OO.type!="text"&&OO.type!="hidden") OO.value=StranText(OO.value);
		if(OO.nodeType==3){OO.data=StranText(OO.data);}
		else StranBody(OO);
	}
}

function JTPYStr()
{
	var zh_s = '制号产于冲松卷干赞皑嗳蔼霭爱嫒碍暧瑷肮翱袄奥坝罢摆败颁办绊帮绑谤镑宝饱报鲍贝狈备钡惫辈绷笔币毕闭毙边编贬变辩辫标鳖别瘪宾滨濒摈饼并拨剥钵驳铂卜补财参残蚕惭惨灿仓沧苍舱册侧厕测层诧掺搀谗馋缠蝉产铲阐颤肠尝偿厂场畅钞车彻尘陈闯衬称撑诚惩骋痴驰迟齿耻炽冲虫宠绸畴筹踌丑厨锄雏橱础储处触传囱疮创锤纯绰词辞赐从葱聪丛凑蹿窜错达带贷单担郸胆掸诞弹惮当挡党荡档导岛捣祷盗灯邓敌涤递缔颠点电垫淀钓迭谍叠钉顶订锭丢东动冻栋斗读犊独赌镀断缎锻队对兑吨钝顿夺堕讹鹅额恶饿儿尔饵贰发罚阀珐矾钒烦饭范贩访纺飞诽废费纷坟奋愤粪丰风枫疯锋冯缝讽凤肤辐抚辅讣妇负复赋缚该钙盖干秆赶赣冈刚岗纲钢皋镐鸽搁阁个铬宫龚巩贡沟钩构购够蛊顾剐关观馆贯惯广归龟规闺硅轨诡刽柜贵辊滚锅国过讥击饥机鸡积绩缉级极辑几挤计记纪际剂济继蓟夹荚颊贾钾价驾坚歼间艰监笺缄拣俭茧捡减检硷简碱见饯剑荐贱涧舰渐溅践鉴键将浆讲奖桨蒋酱娇浇骄胶绞饺矫脚铰搅缴轿较阶秸节杰洁结届诫仅紧谨锦尽劲进晋烬经茎荆惊鲸颈净径痉竞静镜纠旧厩驹举剧惧据锯鹃绢决诀绝觉军钧骏挟槛开凯颗壳课垦恳抠库裤夸块侩宽况旷矿亏岿窥溃馈扩阔腊蜡来莱赖兰拦栏阑蓝谰澜篮览揽缆懒烂滥捞劳涝乐镭垒泪类离篱礼里鲤历厉丽励沥隶砾俩连帘怜涟莲联镰敛脸练炼恋链凉粮两谅辆辽疗镣猎邻临鳞凛赁灵岭凌铃龄领刘馏龙咙笼聋陇垄拢娄楼搂篓卢庐芦炉颅卤虏掳鲁陆录赂禄驴吕侣缕虑绿孪峦挛滦乱抡仑伦沦纶轮论罗萝逻锣箩骡络骆妈马玛码蚂骂吗买迈麦卖脉蛮馒瞒满谩猫锚铆贸么没霉镁门闷们锰梦弥谜觅幂绵缅庙灭闽悯鸣铭谬谋亩儿内纳钠难挠恼脑闹馁你拟腻捻撵酿鸟聂啮镊镍宁拧狞柠泞纽钮农浓脓疟诺欧殴鸥呕沤盘庞赔喷鹏骗飘贫频评凭苹泼颇扑铺朴谱凄栖齐脐骑岂启气讫弃扦迁钎牵铅谦签钱钳潜浅谴堑呛枪强墙蔷抢锹乔侨桥窍翘窃亲钦寝氢轻倾顷请庆穷琼区驱躯趋龋权颧劝却确鹊让饶扰绕热认纫韧绒荣软锐闰润洒萨鳃赛三伞丧骚扫涩杀纱筛晒删闪陕缮赡伤赏烧绍赊设慑摄绅审婶肾渗声胜绳圣尸师诗狮湿时识实蚀驶势视试饰适释寿兽书枢输赎术树竖数帅双谁税顺说烁硕丝饲怂耸讼诵颂擞苏诉肃虽绥随岁孙损笋缩琐锁厦栅属调獭挞抬态贪摊滩瘫坛谈谭叹汤烫涛绦讨腾誊锑题体屉条贴铁厅听烃铜统头秃图涂团颓蜕脱驮驼鸵椭洼袜弯湾顽万网为韦围违维潍伟伪纬苇卫谓温纹闻稳问瓮挝涡窝蜗卧乌污呜诬钨无吴芜坞务误雾牺锡习袭铣戏细虾侠峡狭辖吓纤锨鲜闲贤咸衔显险县现线宪馅羡献乡厢镶详响项萧销嚣晓啸蝎协胁谐携写泻谢锌衅兴汹绣锈须虚嘘许叙绪续轩悬选癣绚学勋寻驯询训讯逊吁侥压鸦鸭哑亚讶烟阉严盐阎颜厌彦砚艳验谚鸯扬阳杨疡养痒样尧窑谣摇遥瑶药爷业叶页一医铱仪遗颐彝蚁义亿忆艺议异译绎诣谊阴荫银饮隐应婴缨樱鹰荧莹萤营蝇赢颖哟佣拥痈咏涌踊优忧犹邮铀游诱鱼娱渔舆与屿语驭狱预御誉鸳渊员园圆缘辕远愿约岳钥悦阅跃粤云匀郧陨运晕酝韵蕴长杂灾载攒暂赞赃脏凿枣灶则择泽责贼赠扎札轧闸铡诈斋债毡斩盏崭辗战栈绽张涨帐胀账赵蛰辙锗这贞针侦诊阵镇争挣狰睁证郑帧织执职纸帜质挚掷滞终钟肿种众诌轴昼皱骤诛诸猪烛嘱瞩贮驻筑铸专砖转赚妆庄桩装壮状锥坠缀赘谆浊兹资渍综踪总纵邹诅组钻榄历叹众皑蔼碍爱翱袄奥坝罢摆败颁办绊帮绑镑谤剥饱宝报鲍辈贝钡狈备惫绷笔毕毙闭边编贬变辩辫鳖瘪濒滨宾摈饼拨钵铂驳卜补参蚕残惭惨灿苍舱仓沧厕侧册测层诧搀掺蝉馋谗缠铲产阐颤场尝长偿肠厂畅钞车彻尘陈衬撑称惩诚骋痴迟驰耻齿炽冲虫宠畴踌筹绸丑橱厨锄雏础储触处传疮闯创锤纯绰辞词赐聪葱囱从丛凑窜错达带贷担单郸掸胆惮诞弹当挡党荡档捣岛祷导盗灯邓敌涤递缔点垫电淀钓调迭谍叠钉顶锭订东动栋冻斗犊独读赌镀锻断缎兑队对吨顿钝夺鹅额讹恶饿儿尔饵贰发罚阀珐矾钒烦范贩饭访纺飞废费纷坟奋愤粪丰枫锋风疯冯缝讽凤肤辐抚辅赋复负讣妇缚该钙盖干赶秆赣冈刚钢纲岗皋镐搁鸽阁铬个给龚宫巩贡钩沟构购够蛊顾剐关观馆惯贯广规硅归龟闺轨诡柜贵刽辊滚锅国过骇韩汉阂鹤贺横轰鸿红后壶护沪户哗华画划话怀坏欢环还缓换唤痪焕涣黄谎挥辉毁贿秽会烩汇讳诲绘荤浑伙获货祸击机积饥讥鸡绩缉极辑级挤几蓟剂济计记际继纪夹荚颊贾钾价驾歼监坚笺间艰缄茧检碱硷拣捡简俭减荐槛鉴践贱见键舰剑饯渐溅涧浆蒋桨奖讲酱胶浇骄娇搅铰矫侥脚饺缴绞轿较秸阶节茎惊经颈静镜径痉竞净纠厩旧驹举据锯惧剧鹃绢杰洁结诫届紧锦仅谨进晋烬尽劲荆觉决诀绝钧军骏开凯颗壳课垦恳抠库裤夸块侩宽矿旷况亏岿窥馈溃扩阔蜡腊莱来赖蓝栏拦篮阑兰澜谰揽览懒缆烂滥捞劳涝乐镭垒类泪篱离里鲤礼丽厉励砾历沥隶俩联莲连镰怜涟帘敛脸链恋炼练粮凉两辆谅疗辽镣猎临邻鳞凛赁龄铃凌灵岭领馏刘龙聋咙笼垄拢陇楼娄搂篓芦卢颅庐炉掳卤虏鲁赂禄录陆驴吕铝侣屡缕虑滤绿峦挛孪滦乱抡轮伦仑沦纶论萝罗逻锣箩骡骆络妈玛码蚂马骂吗买麦卖迈脉瞒馒蛮满谩猫锚铆贸么霉没镁门闷们锰梦谜弥觅绵缅庙灭悯闽鸣铭谬谋亩钠纳难挠脑恼闹馁腻撵捻酿鸟聂啮镊镍柠狞宁拧泞钮纽脓浓农疟诺欧鸥殴呕沤盘庞国爱赔喷鹏骗飘频贫苹凭评泼颇扑铺朴谱脐齐骑岂启气弃讫牵扦钎铅迁签谦钱钳潜浅谴堑枪呛墙蔷强抢锹桥乔侨翘窍窃钦亲轻氢倾顷请庆琼穷趋区躯驱龋颧权劝却鹊让饶扰绕热韧认纫荣绒软锐闰润洒萨鳃赛伞丧骚扫涩杀纱筛晒闪陕赡缮伤赏烧绍赊摄慑设绅审婶肾渗声绳胜圣师狮湿诗尸时蚀实识驶势释饰视试寿兽枢输书赎属术树竖数帅双谁税顺说硕烁丝饲耸怂颂讼诵擞苏诉肃虽绥岁孙损笋缩琐锁獭挞抬摊贪瘫滩坛谭谈叹汤烫涛绦腾誊锑题体屉条贴铁厅听烃铜统头图涂团颓蜕脱鸵驮驼椭洼袜弯湾顽万网韦违围为潍维苇伟伪纬谓卫温闻纹稳问瓮挝蜗涡窝呜钨乌诬无芜吴坞雾务误锡牺袭习铣戏细虾辖峡侠狭厦锨鲜纤咸贤衔闲显险现献县馅羡宪线厢镶乡详响项萧销晓啸蝎协挟携胁谐写泻谢锌衅兴汹锈绣虚嘘须许绪续轩悬选癣绚学勋询寻驯训讯逊压鸦鸭哑亚讶阉烟盐严颜阎艳厌砚彦谚验鸯杨扬疡阳痒养样瑶摇尧遥窑谣药爷页业叶医铱颐遗仪彝蚁艺亿忆义诣议谊译异绎荫阴银饮樱婴鹰应缨莹萤营荧蝇颖哟拥佣痈踊咏涌优忧邮铀犹游诱舆鱼渔娱与屿语吁御狱誉预驭鸳渊辕园员圆缘远愿约跃钥岳粤悦阅云郧匀陨运蕴酝晕韵杂灾载攒暂赞赃脏凿枣灶责择则泽贼赠扎札轧铡闸诈斋债毡盏斩辗崭栈战绽张涨帐账胀赵蛰辙锗这贞针侦诊镇阵挣睁狰帧郑证织职执纸挚掷帜质钟终种肿众诌轴皱昼骤猪诸诛烛瞩嘱贮铸筑驻专砖转赚桩庄装妆壮状锥赘坠缀谆浊兹资渍踪综总纵邹诅组钻致钟么为只凶准启板里雳余链泄';
	return zh_s;
}

function FTPYStr()
{
	var zh_t = '製號產於衝鬆捲乾讚皚噯藹靄愛嬡礙曖璦骯翺襖奧壩罷擺敗頒辦絆幫綁謗鎊寶飽報鮑貝狽備鋇憊輩繃筆幣畢閉斃邊編貶變辯辮標鼈別癟賓濱瀕擯餅並撥剝缽駁鉑蔔補財參殘蠶慚慘燦倉滄蒼艙冊側廁測層詫摻攙讒饞纏蟬産鏟闡顫腸嘗償廠場暢鈔車徹塵陳闖襯稱撐誠懲騁癡馳遲齒恥熾沖蟲寵綢疇籌躊醜廚鋤雛櫥礎儲處觸傳囪瘡創錘純綽詞辭賜從蔥聰叢湊躥竄錯達帶貸單擔鄲膽撣誕彈憚當擋黨蕩檔導島搗禱盜燈鄧敵滌遞締顛點電墊澱釣叠諜疊釘頂訂錠丟東動凍棟鬥讀犢獨賭鍍斷緞鍛隊對兌噸鈍頓奪墮訛鵝額惡餓兒爾餌貳發罰閥琺礬釩煩飯範販訪紡飛誹廢費紛墳奮憤糞豐風楓瘋鋒馮縫諷鳳膚輻撫輔訃婦負複賦縛該鈣蓋幹稈趕贛岡剛崗綱鋼臯鎬鴿擱閣個鉻宮龔鞏貢溝鈎構購夠蠱顧剮關觀館貫慣廣歸龜規閨矽軌詭劊櫃貴輥滾鍋國過譏擊饑機雞積績緝級極輯幾擠計記紀際劑濟繼薊夾莢頰賈鉀價駕堅殲間艱監箋緘揀儉繭撿減檢鹼簡堿見餞劍薦賤澗艦漸濺踐鑒鍵將漿講獎槳蔣醬嬌澆驕膠絞餃矯腳鉸攪繳轎較階稭節傑潔結屆誡僅緊謹錦盡勁進晉燼經莖荊驚鯨頸淨徑痙競靜鏡糾舊廄駒舉劇懼據鋸鵑絹決訣絕覺軍鈞駿挾檻開凱顆殼課墾懇摳庫褲誇塊儈寬況曠礦虧巋窺潰饋擴闊臘蠟來萊賴蘭攔欄闌藍讕瀾籃覽攬纜懶爛濫撈勞澇樂鐳壘淚類離籬禮裏鯉曆厲麗勵瀝隸礫倆連簾憐漣蓮聯鐮斂臉練煉戀鏈涼糧兩諒輛遼療鐐獵鄰臨鱗凜賃靈嶺淩鈴齡領劉餾龍嚨籠聾隴壟攏婁樓摟簍盧廬蘆爐顱鹵虜擄魯陸錄賂祿驢呂侶縷慮綠孿巒攣灤亂掄侖倫淪綸輪論羅蘿邏鑼籮騾絡駱媽馬瑪碼螞罵嗎買邁麥賣脈蠻饅瞞滿謾貓錨鉚貿麽沒黴鎂門悶們錳夢彌謎覓冪綿緬廟滅閩憫鳴銘謬謀畝兒內納鈉難撓惱腦鬧餒妳擬膩撚攆釀鳥聶齧鑷鎳甯擰獰檸濘紐鈕農濃膿瘧諾歐毆鷗嘔漚盤龐賠噴鵬騙飄貧頻評憑蘋潑頗撲鋪樸譜淒棲齊臍騎豈啓氣訖棄扡遷釺牽鉛謙簽錢鉗潛淺譴塹嗆槍強牆薔搶鍬喬僑橋竅翹竊親欽寢氫輕傾頃請慶窮瓊區驅軀趨齲權顴勸卻確鵲讓饒擾繞熱認紉韌絨榮軟銳閏潤灑薩鰓賽叁傘喪騷掃澀殺紗篩曬刪閃陝繕贍傷賞燒紹賒設懾攝紳審嬸腎滲聲勝繩聖屍師詩獅濕時識實蝕駛勢視試飾適釋壽獸書樞輸贖術樹豎數帥雙誰稅順說爍碩絲飼慫聳訟誦頌擻蘇訴肅雖綏隨歲孫損筍縮瑣鎖廈柵屬調獺撻擡態貪攤灘癱壇談譚歎湯燙濤縧討騰謄銻題體屜條貼鐵廳聽烴銅統頭禿圖塗團頹蛻脫馱駝鴕橢窪襪彎灣頑萬網爲韋圍違維濰偉僞緯葦衛謂溫紋聞穩問甕撾渦窩蝸臥烏汙嗚誣鎢無吳蕪塢務誤霧犧錫習襲銑戲細蝦俠峽狹轄嚇纖鍁鮮閑賢鹹銜顯險縣現線憲餡羨獻鄉廂鑲詳響項蕭銷囂曉嘯蠍協脅諧攜寫瀉謝鋅釁興洶繡鏽須虛噓許敘緒續軒懸選癬絢學勳尋馴詢訓訊遜籲僥壓鴉鴨啞亞訝煙閹嚴鹽閻顔厭彥硯豔驗諺鴦揚陽楊瘍養癢樣堯窯謠搖遙瑤藥爺業葉頁壹醫銥儀遺頤彜蟻義億憶藝議異譯繹詣誼陰蔭銀飲隱應嬰纓櫻鷹熒瑩螢營蠅贏穎喲傭擁癰詠湧踴優憂猶郵鈾遊誘魚娛漁輿與嶼語馭獄預禦譽鴛淵員園圓緣轅遠願約嶽鑰悅閱躍粵雲勻鄖隕運暈醞韻蘊長雜災載攢暫贊贓髒鑿棗竈則擇澤責賊贈紮劄軋閘鍘詐齋債氈斬盞嶄輾戰棧綻張漲帳脹賬趙蟄轍鍺這貞針偵診陣鎮爭掙猙睜證鄭幀織執職紙幟質摯擲滯終鍾腫種衆謅軸晝皺驟誅諸豬燭囑矚貯駐築鑄專磚轉賺妝莊樁裝壯狀錐墜綴贅諄濁茲資漬綜蹤總縱鄒詛組鑽欖歷嘆眾皚藹礙愛翺襖奧壩罷擺敗頒辦絆幫綁鎊謗剝飽寶報鮑輩貝鋇狽備憊繃筆畢斃閉邊編貶變辯辮鼈癟瀕濱賓擯餅撥缽鉑駁蔔補參蠶殘慚慘燦蒼艙倉滄廁側冊測層詫攙摻蟬饞讒纏鏟産闡顫場嘗長償腸廠暢鈔車徹塵陳襯撐稱懲誠騁癡遲馳恥齒熾沖蟲寵疇躊籌綢醜櫥廚鋤雛礎儲觸處傳瘡闖創錘純綽辭詞賜聰蔥囪從叢湊竄錯達帶貸擔單鄲撣膽憚誕彈當擋黨蕩檔搗島禱導盜燈鄧敵滌遞締點墊電澱釣調叠諜疊釘頂錠訂東動棟凍鬥犢獨讀賭鍍鍛斷緞兌隊對噸頓鈍奪鵝額訛惡餓兒爾餌貳發罰閥琺礬釩煩範販飯訪紡飛廢費紛墳奮憤糞豐楓鋒風瘋馮縫諷鳳膚輻撫輔賦複負訃婦縛該鈣蓋幹趕稈贛岡剛鋼綱崗臯鎬擱鴿閣鉻個給龔宮鞏貢鈎溝構購夠蠱顧剮關觀館慣貫廣規矽歸龜閨軌詭櫃貴劊輥滾鍋國過駭韓漢閡鶴賀橫轟鴻紅後壺護滬戶嘩華畫劃話懷壞歡環還緩換喚瘓煥渙黃謊揮輝毀賄穢會燴彙諱誨繪葷渾夥獲貨禍擊機積饑譏雞績緝極輯級擠幾薊劑濟計記際繼紀夾莢頰賈鉀價駕殲監堅箋間艱緘繭檢堿鹼揀撿簡儉減薦檻鑒踐賤見鍵艦劍餞漸濺澗漿蔣槳獎講醬膠澆驕嬌攪鉸矯僥腳餃繳絞轎較稭階節莖驚經頸靜鏡徑痙競淨糾廄舊駒舉據鋸懼劇鵑絹傑潔結誡屆緊錦僅謹進晉燼盡勁荊覺決訣絕鈞軍駿開凱顆殼課墾懇摳庫褲誇塊儈寬礦曠況虧巋窺饋潰擴闊蠟臘萊來賴藍欄攔籃闌蘭瀾讕攬覽懶纜爛濫撈勞澇樂鐳壘類淚籬離裏鯉禮麗厲勵礫曆瀝隸倆聯蓮連鐮憐漣簾斂臉鏈戀煉練糧涼兩輛諒療遼鐐獵臨鄰鱗凜賃齡鈴淩靈嶺領餾劉龍聾嚨籠壟攏隴樓婁摟簍蘆盧顱廬爐擄鹵虜魯賂祿錄陸驢呂鋁侶屢縷慮濾綠巒攣孿灤亂掄輪倫侖淪綸論蘿羅邏鑼籮騾駱絡媽瑪碼螞馬罵嗎買麥賣邁脈瞞饅蠻滿謾貓錨鉚貿麽黴沒鎂門悶們錳夢謎彌覓綿緬廟滅憫閩鳴銘謬謀畝鈉納難撓腦惱鬧餒膩攆撚釀鳥聶齧鑷鎳檸獰甯擰濘鈕紐膿濃農瘧諾歐鷗毆嘔漚盤龐國愛賠噴鵬騙飄頻貧蘋憑評潑頗撲鋪樸譜臍齊騎豈啓氣棄訖牽扡釺鉛遷簽謙錢鉗潛淺譴塹槍嗆牆薔強搶鍬橋喬僑翹竅竊欽親輕氫傾頃請慶瓊窮趨區軀驅齲顴權勸卻鵲讓饒擾繞熱韌認紉榮絨軟銳閏潤灑薩鰓賽傘喪騷掃澀殺紗篩曬閃陝贍繕傷賞燒紹賒攝懾設紳審嬸腎滲聲繩勝聖師獅濕詩屍時蝕實識駛勢釋飾視試壽獸樞輸書贖屬術樹豎數帥雙誰稅順說碩爍絲飼聳慫頌訟誦擻蘇訴肅雖綏歲孫損筍縮瑣鎖獺撻擡攤貪癱灘壇譚談歎湯燙濤縧騰謄銻題體屜條貼鐵廳聽烴銅統頭圖塗團頹蛻脫鴕馱駝橢窪襪彎灣頑萬網韋違圍爲濰維葦偉僞緯謂衛溫聞紋穩問甕撾蝸渦窩嗚鎢烏誣無蕪吳塢霧務誤錫犧襲習銑戲細蝦轄峽俠狹廈鍁鮮纖鹹賢銜閑顯險現獻縣餡羨憲線廂鑲鄉詳響項蕭銷曉嘯蠍協挾攜脅諧寫瀉謝鋅釁興洶鏽繡虛噓須許緒續軒懸選癬絢學勳詢尋馴訓訊遜壓鴉鴨啞亞訝閹煙鹽嚴顔閻豔厭硯彥諺驗鴦楊揚瘍陽癢養樣瑤搖堯遙窯謠藥爺頁業葉醫銥頤遺儀彜蟻藝億憶義詣議誼譯異繹蔭陰銀飲櫻嬰鷹應纓瑩螢營熒蠅穎喲擁傭癰踴詠湧優憂郵鈾猶遊誘輿魚漁娛與嶼語籲禦獄譽預馭鴛淵轅園員圓緣遠願約躍鑰嶽粵悅閱雲鄖勻隕運蘊醞暈韻雜災載攢暫贊贓髒鑿棗竈責擇則澤賊贈紮劄軋鍘閘詐齋債氈盞斬輾嶄棧戰綻張漲帳賬脹趙蟄轍鍺這貞針偵診鎮陣掙睜猙幀鄭證織職執紙摯擲幟質鍾終種腫衆謅軸皺晝驟豬諸誅燭矚囑貯鑄築駐專磚轉賺樁莊裝妝壯狀錐贅墜綴諄濁茲資漬蹤綜總縱鄒詛組鑽緻鐘麼為隻兇準啟闆裡靂餘鍊洩';
	return zh_t;
}

function Traditionalized(cc){
	var str='',ss=JTPYStr(),tt=FTPYStr();
	for(var i=0;i<cc.length;i++)
	{
		if(cc.charCodeAt(i)>10000&&ss.indexOf(cc.charAt(i))!=-1)str+=tt.charAt(ss.indexOf(cc.charAt(i)));
		else str+=cc.charAt(i);
	}
	return str;
}

function Simplized(cc){
	var str='',ss=JTPYStr(),tt=FTPYStr();
	for(var i=0;i<cc.length;i++)
	{
		if(cc.charCodeAt(i)>10000&&tt.indexOf(cc.charAt(i))!=-1)str+=ss.charAt(tt.indexOf(cc.charAt(i)));
		else str+=cc.charAt(i);
	}
	return str;
}

function setCookie(name, value)  //cookies设置
{
	var argv = setCookie.arguments;
	var argc = setCookie.arguments.length;
	var expires = (argc > 2) ? argv[2] : null;
	if(expires!=null)
	{
		var LargeExpDate = new Date ();
		LargeExpDate.setTime(LargeExpDate.getTime() + (expires*1000*3600*24));
	}
	document.cookie = name + "=" + escape (value)+((expires == null) ? "" : ("; expires=" +LargeExpDate.toGMTString()));
}

function getCookie(Name)   //cookies读取
{
	var search = Name + "="
	if(document.cookie.length > 0)
	{
		offset = document.cookie.indexOf(search);
		if(offset != -1)
		{
			offset += search.length;
			end = document.cookie.indexOf(";", offset);
			if(end == -1) end = document.cookie.length;
			return unescape(document.cookie.substring(offset, end));
		}
		else return ""
	}
}

var StranLink_Obj=document.getElementById("StranLink");
if (StranLink_Obj) {
	var JF_cn="ft"+self.location.hostname.toString().replace(/\./g,"");
	var BodyIsFt=getCookie(JF_cn);
	if (BodyIsFt!="1") BodyIsFt=Default_isFT;
	with(StranLink_Obj) {
		if(typeof(document.all)!="object") { //非IE浏览器
			href="javascript:StranBody()"
		} else {
			href="#";
			οnclick= new Function("StranBody();return false;");
		}
		title=StranText("点击以繁体中文方式浏览",1,1);
		innerHTML=StranText(innerHTML,1,1);
	}
	if(BodyIsFt=="1"){
		setTimeout("StranBody()",StranIt_Delay)
	}
}